{"data": {
 "bg": "http://file.toyhou.se/images/4688984_41BpWUeYz3OVmbD.jpg",
 "info": {
	"aliases": "Fritz, Fred",
	"age": "~300 (appears 65)", 
	"gender": "Male", 
	"height": "195cm",
	"weight": "107kg",
	"birthday": "June 4",
	"species": "Vampire",
	"occupation": "Obervampir",
	"nationality": "German",
	"languages": "German, heavily accented English",
	"voice": "Bass",
	"orientation": "Aromantic-Bisexual",
	"relationship": "Open/Free"
 },
 "overview": "<p>Friederich von Hass is an extremely unpleasant vampire from Germany. His association with the word \"hate\" in his name is not from nobility, but from his reputation for causing others to feel hatred. Sometimes, he may end up being the target of this hate, and at other times, he is not.</p><img style=\"width: 100%;\" src=\"https://raw.githubusercontent.com/Algorithmus/DiasporicCrypt/master/game/gui/global/friederich-select.png\"/>",
 "appearance": "Unlike most vampires, his ears are not pointed. He doesn't wash the blood off of his clothes or skin, which results in him smelling like rotting flesh and blood.",
 "skills": [
	{
	 "title": "Skilled Swordsman",
	 "description": "Friederich was already a very skilled swordsman before he became a vampire. He still maintains this ability to some degree, but it has been used in combination with his other vampire powers, enhancing them beyond what is humanly possible. Even against most other vampires, his sword skills are unmatched."
	},
	{
	 "title": "Flesh Eater",
	 "description": "Sometime after becoming a vampire, Friederich developed a taste for eating flesh. The result would cause humans to die, but vampires, who can regenerate their own flesh, don't die from this. They may still find it painful though. Because of his cruelty, Friederich often eats his victims alive. When he first started doing this, he would often just eat the victim's flesh and leave their bones behind, but he eventually was able to consume their bones, and leave almost no trace of the victim behind. The consuming of the flesh, however, does not confer any real benefits over simply drinking the blood of victims, as vampires require only blood for sustenance, and any nutrition that comes from the flesh itself (eg, proteins) is not consumed by vampires. This ability is something Friederich uses primarily to cause hate in other people, and not because it makes him stronger than other vampires who only drink blood."
	},
	{
	 "title": "Regeneration",
	 "description": "So long as he isn't under sunlight, Friederich can regenerate his own flesh. This unfortunately also allows him to benefit from his masochistic side, as he can be injured beyond any point a normal human being would die from it. He has had chunks of flesh from his torso gouged out, bitten, eaten, stabbed and scratched in many places, either from fighting or from pleasure, and the blood loss combined with the high levels of pain would cause him to die if he was still human."
	},
	{
	 "title": "Void Magician",
	 "description": "As an Obervampir, Friederich is fairly adept with many basic magical abilities that many vampires have access to. His favorite and most powerful magical abilities are void spells that involve sending objects to and from the void space. This has certain benefits for him in battle, as he can hide parts of his body in this dimension to evade attacks, or to store very powerful swords and use them at will when required. He also uses void space to send parts of his body away from himself by opening void portals in a different location. There is of course, a limit to what kinds of objects he can send through the void space, or how far away from him the portals can be, although he has improved and developed this ability over time, and can send objects through void portals nearly 1km away from himself. He can send objects as large as a small house through a void portal, but certain special objects with very specific properties, usually relics or other objects that contain mysterious powers cannot be sent through a void portal."
	},
	{
	 "title" : "Bat Familiar",
	 "description": "As a vampire, Friederich has access to a familiar. His familiar takes on the form of a bat. Because of their size, and relative ease of summoning, Friederich can call many of them at a time. His signature bat familiar is a large white bat with red eyes. He can also transform into his familiar as a form of an evasion or confusion tactic or as a means of flying, usually for scouting out an area from above. Because of their small size and ability to fly, they make good spies, and can often hang inconspicuously from dark corners in ceilings, near windows, on treetops or behind other objects without being noticed. Because his bats are incapable of understanding human speech, they are only capable of relaying to Friederich what they have seen and heard, but not what they are talking about. He can also use his bats like missiles in battle, where he sends them flying at enemies and then explode on contact."
	},
	{
	 "title": "Demonic",
	 "description": "Friederich's demonic is several times physically stronger than his regular form, and he can additionally fly, run faster and use stronger versions of his void spells. He also uses his long tail to both defend and attack like a whip. The bones at the end of his tail are so dense that they can smash and dent even large boulders. In this form, he can send some relics and certain objects through void portals that he could not in his regular form, and his range with void spells increases. He becomes more aggressive and sadistic in this form, menacingly devouring his enemies and victims, whereas before, he would only consume his victims at a leisurely pace. He rarely ever uses this form for anything other than battles though, and only if he thinks he can't defeat an enemy in his usual form."
	}],
 "concept": "<p>Friederich was originally created for a contest on <a href=\"http://animexx.de\">Animexx<a/>, where he was supposed to depict the \"hate\" theme. Some inspirations for his design came from Manfred von Karma from the Ace Attorney series. In the contest entry, he wasn't originally intended to be a vampire, so he didn't start off with long ears either. The clothing design didn't come from any particular model, but was made to be dark because it was appropriate for the original hate theme. However, I ended up liking it unexpectedly, and he's been around because of that. You could say some of his later personality and quirks were inspired by Rammstein songs like Mein Teil, and after hearing about the mess that is Twilight, I wanted a vampire more like a monster than an angsty teen emo. He looked the part anyways, so he's a vampire now.</p><p>He didn't start off with a name either, as I almost never give my one time image OCs names. Since he was made for a contest on a German website, I figured I'd just give him a regular German name. Unfortunately, I spelled it wrong, and I've been keeping that alternate spelling ever since for consistency.</p>",
 "history": "Very little is known about Friederich's life before he became a vampire, but he appears to have inherited some of his skills before then, like his proficiency with swords and reading Latin. He eventually develops an obsession for causing hate, taste for eating flesh and gains enough power to be considered an Obervampir. He lives for nearly three centuries as a vampire, and while he is allowed to take refuge in vampire castles, it is only because of his hosts' fear of him that they do so.",
 "trivia": "<ul><li>The great majority of characters use Friederich's first or last name when referring to him. He has a lesser known nickname, Fritz, which only Adela reserves for him. A few other artists/authors have also chosen to use the nickname instead because it is easier to pronounce and spell for non-German speakers than his original name.</li><li>He's rumored to wear many undergarments, including a pair of boxers, underwear, a jock strap, a censor bar and even a bat. In reality, he doesn't wear anything under his pants. I just like to mess with people.</li><li>He eats sparklepires for breakfast.</li><li>Despite being all serious looking, I make fun of him a lot. I put him in lederhosen almost every Oktoberfest and he gets plenty of ugly Christmas sweater entries as well. He's even been seen once in a wedding dress.</li></ul>"
}
}
